ALPHABET = "АБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ"

UKRAINIAN_FREQS = {
    'А': 0.0800, 'Б': 0.0153, 'В': 0.0550, 'Г': 0.0160, 'Ґ': 0.0001, 'Д': 0.0298,
    'Е': 0.0500, 'Є': 0.0064, 'Ж': 0.0071, 'З': 0.0232, 'И': 0.0600, 'І': 0.0620,
    'Ї': 0.0062, 'Й': 0.0124, 'К': 0.0350, 'Л': 0.0360, 'М': 0.0310, 'Н': 0.0710,
    'О': 0.0940, 'П': 0.0284, 'Р': 0.0480, 'С': 0.0460, 'Т': 0.0550, 'У': 0.0340,
    'Ф': 0.0026, 'Х': 0.0117, 'Ц': 0.0102, 'Ч': 0.0115, 'Ш': 0.0071, 'Щ': 0.0032,
    'Ь': 0.0183, 'Ю': 0.0070, 'Я': 0.0216
}

def clean_text(text):
    return ''.join(char for char in text.upper() if char in ALPHABET)